In [1]:
import pandas as pd
import numpy as np

In [2]:
df= pd.read_csv('C:/Users/anike/OneDrive/Desktop/Learning Pandas/Datasets/Session-17/ipl-matches.csv')
ipl= pd.DataFrame(df)
df= pd.read_csv('C:/Users/anike/OneDrive/Desktop/Learning Pandas/Datasets/Session-17/movies.csv')
movies= pd.DataFrame(df)
df = pd.read_csv("C:/Users/anike/OneDrive/Desktop/Learning Pandas/Datasets/Session-16/kohli_ipl.csv")
vk= df['runs']

---

# Important Dataframe Functions:
## .astype():
- converts the dtype of given parameter into another parameter.
- helps in memory optimization and saving memory.

In [3]:
ipl['Team1'].astype('category')
ipl['Team2'].astype('category')

0                   Gujarat Titans
1                 Rajasthan Royals
2             Lucknow Super Giants
3                   Gujarat Titans
4                     Punjab Kings
                  ...
945                Deccan Chargers
946    Royal Challengers Bangalore
947               Rajasthan Royals
948            Chennai Super Kings
949          Kolkata Knight Riders
Name: Team2, Length: 950, dtype: category
Categories (18, object): ['Chennai Super Kings', 'Deccan Chargers', 'Delhi Capitals', 'Delhi Daredevils', ..., 'Rising Pune Supergiant', 'Rising Pune Supergiants', 'Royal Challengers Bangalore', 'Sunrisers Hyderabad']

---

## .between():
- returns a boolean value for whether the series value lies in the given range.

In [4]:
vk[vk.between(50,99)].shape[0]

45

---

## .clip():
- clips data between a given range.

In [5]:
df = pd.read_csv("C:/Users/anike/OneDrive/Desktop/Learning Pandas/Datasets/Session-16/subs.csv")
subs= df['Subscribers gained']

In [6]:
subs.clip(100, 200)

0      100
1      100
2      100
3      100
4      100
      ...
360    200
361    200
362    155
363    144
364    172
Name: Subscribers gained, Length: 365, dtype: int64

---

## .drop_duplicates():
- removes non unique values from series.

In [7]:
temp = pd.Series([1, 1, 2, 2, 2, 3, 3, 4 , 4, 5, 5])
temp.drop_duplicates()

0    1
2    2
5    3
7    4
9    5
dtype: int64

In [8]:
temp.drop_duplicates(keep='last') # keeps the last occurrence of the duplicate value.

1     1
4     2
6     3
8     4
10    5
dtype: int64

---

## .duplictaed()
- returns a boolean value for whether a value is duplicated or not

In [13]:
temp.duplicated().sum() # returns a boolean value for whether a value is duplicated or not

np.int64(6)

---

## .isnull():
- returns a boolean value for whether a value is null or not

In [10]:
vk.isnull().sum() # returns the number of null values in the series

np.int64(0)

---

## .dropna():
- removes the null values from the series.

In [14]:
data = {
    'Name': ['Anni', 'Aman', 'Ashish', 'Balendu', 'Shubham'],
    'Age': [19, np.nan, 22, 20, np.nan],
    'Maths': [95, 45, np.nan, 30, 101],
    'Science': [89, 55, 120, np.nan, -5],
    'City': ['Patna', np.nan, 'Patna', 'Muzaffarpur', 'Gaya']
}

df = pd.DataFrame(data)
df.dropna()

   Name   Age  Maths  Science   City
0  Anni  19.0   95.0     89.0  Patna

---

## .fillna():
- replaces the null values with a specified value.

In [15]:
df.fillna(0) # replaces all NaN values with 0

      Name   Age  Maths  Science         City
0     Anni  19.0   95.0     89.0        Patna
1     Aman   0.0   45.0     55.0            0
2   Ashish  22.0    0.0    120.0        Patna
3  Balendu  20.0   30.0      0.0  Muzaffarpur
4  Shubham   0.0  101.0     -5.0         Gaya

---

## .isin():
- returuns a boolean value for whether values passed as a list is present in the series or not

In [17]:
vk[vk.isin([50, 100, 150])] # returns a boolean series indicating whether each element is in the list

14      50
119    100
163    100
181     50
Name: runs, dtype: int64

---

# .apply():
- This function applies a function along the axis of the DataFrame or Series.

In [22]:
movies['lead_actor'] = movies['actors'].str.split('|').apply(lambda x: x[0] if isinstance(x, list) and len(x)>0 else np.nan)
movies.head(2)  # Display the first two rows to verify the new column

,title_x,imdb_id,poster_path,wiki_link,title_y,original_title,is_adult,year_of_release,runtime,genres,imdb_rating,imdb_votes,story,summary,tagline,actors,wins_nominations,release_date,lead_actor
0,Uri: The Surgical Strike,tt8291224,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/Uri:_The_Surgica...,Uri: The Surgical Strike,Uri: The Surgical Strike,0,2019,138,Action|Drama|War,8.4,35112,Divided over five chapters the film chronicle...,Indian army special forces execute a covert op...,NaN,Vicky Kaushal|Paresh Rawal|Mohit Raina|Yami Ga...,4 wins,11 January 2019 (USA),Vicky Kaushal
1,Battalion 609,tt9472208,NaN,https://en.wikipedia.org/wiki/Battalion_609,Battalion 609,Battalion 609,0,2019,131,War,4.1,73,The story revolves around a cricket match betw...,The story of Battalion 609 revolves around a c...,NaN,Vicky Ahuja|Shoaib Ibrahim|Shrikant Kamat|Elen...,NaN,11 January 2019 (India),Vicky Ahuja